emacs/.emacs.d/config.org
 #+title: GNU Emacs configuration
#+author: Marco Bretzke
#+email: marcom@area030.org
#+language: en
#+options: ':t toc:nil num:t author:t email:t
#+startup: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

[ Last revised and exported on *{{{latest-export-date}}}* with a word
  count of *{{{word-count}}}*. ]

This is my literate Emacs configuration file. Following the idea and structure
of Prot <https://github.com/protesilaos/dotfiles/blob/master/emacs/.emacs.d/prot-emacs.org>
to not tangle a single org file on startup as it is very slow and loads org 
each time i start emacs. 
I am using this file as my main source of truth and all my configurations are
generated from here in sepeated modules. This makes troubleshooting much easier 
and the parts can be called or shared individually.
After editing this filei can either evaluate by pressing =C-c C-v C-t= or by
evaluating the following code block to update all the files. 

#+begin_src emacs-lisp :tangle no :results none
(org-babel-tangle)
#+end_src

* Structure of the Emacs configuration
  - The current config.org file
  - early-init.el 
  - init.el
  - modules folder

* The early initialization (=early-init.el=)
A few of the code blocks tangle to =early-init.el= to get the effects in the 
very beginning of the initialization.

* Main initialization (=init.el=)
To comply with the Emacs [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Library-Headers.html][conventions]] for libraries, the tangled =init.el= must have the following header and [[sec:foot][footer]]:

** The =init.el= Header

#+begin_src emacs-lisp :tangle init.el
  ;;; init.el --- Marco's Emacs configuration -*- lexical-binding: t -*-

  ;; Copyright (C) 2025 Marco Bretzke

  ;; Author: Marco Bretzke <gmail.com>
  ;; Keywords: internal
  ;; URL: https://marcobre.github.comio/emacsd/

  ;;; Commentary:
  ;; A modularized literate Emacs configuration 

  ;;; Code:
#+end_src
** The =init.el= essential settings
Here we define some basic UI settings independent from any packages
#+begin_src emacs-lisp :tangle init.el

           ;; Disable autosaving and backups and lockfiles
           auto-save-default nil
           backup-inhibited nil
           create-lockfiles nil
           ;;(setq make-backup-files nil) ;; stop creating those backup~ files
           ;;(setq auto-save-default nil) ;; stop creating those #autosave# files
           ;; Allow 20MB of memory (instead of 0.76MB default) before calling
           ;; garbage collection. This means GC runs less often, which speeds
           ;; up some operations
           (setq gc-cons-threshold 20000000)
           (setq inhibit-startup-message t)
           (scroll-bar-mode -1)        ; Disable visible scrollbar
           (tool-bar-mode -1)          ; Disable the toolbar
           (tooltip-mode -1)           ; Disable tooltips
           (set-fringe-mode 10)        ; Give some breathing room
           ;;(menu-bar-mode -1)            ; Disable the menu bar

           (setq context-menu-mode t) ; new context menue used with right mouse button in emacs28 https://www.masteringemacs.org/article/whats-new-in-emacs-28-1
           ;; Set up the visible bell
           (setq visible-bell t)
           ;; line number settings
           (column-number-mode)
           (global-display-line-numbers-mode t)
           ;; Set frame transparency
           ;; Make frame transparency overridable
           (defvar mb/frame-transparency '(90 . 90))
               (set-frame-parameter (selected-frame) 'alpha mb/frame-transparency)
               (add-to-list 'default-frame-alist `(alpha . ,mb/frame-transparency))
           ;; (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
           ;;(add-to-list 'default-frame-alist '(fullscreen . maximized))

           ;; Disable line numbers for some modes

           (dolist (mode '(org-mode-hook
                           shell-mode-hook
                           treemacs-mode-hook
                           eshell-mode-hook))
           (add-hook mode (lambda () (display-line-numbers-mode 0))))

           ;; y or n is enough
           (fset 'yes-or-no-p 'y-or-n-p)

        (use-package savehist :init (savehist-mode 1))
           ;;:bind
           ;;(;; Make ESC close prompts
           ;; ("<escape>" . keyboard-escape-quit)
           ;; ("C-c C-r" . revert-buffer-no-confirm)))
#+end_src

** The =init.el= Load Path for the modules and lisp subfolders
  I am currently trying out to split this single config into seperate modules
  by tangling them into a modules subfolder and loading them with require

#+begin_src emacs-lisp :tangle "init.el"

  ;;; Add modules and lisp subfolders of emacs.d to load path
  (dolist (path (list (expand-file-name "modules" user-emacs-directory)
                      (expand-file-name "lisp" user-emacs-directory)))
    (add-to-list 'load-path path))
#+end_src

** The =init.el= Module List to be loaded
Load modules as require statement from the path

#+begin_src emacs-lisp :tangle "init.el"
  ;;;; Modules
  (require 'marcom-straight)
  (require 'marcom-which-key)
  (require 'marcom-vertico)
  (require 'marcom-theme)
  (require 'marcom-keybindings)
  (require 'marcom-org)
  (require 'marcom-deft)
#+end_src

* My Emacs Module configurations

** The =marcom-straight.el= module
This module loads the straight.el package manager and deactivates the package.el
*** Installation & Initialization of straight.el
Taken from: https://github.com/raxod502/straight.el#getting-started

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-straight.el"
(defvar bootstrap-version)
(let ((bootstrap-file
       (locate-user-emacs-file "straight/repos/straight.el/bootstrap.el"))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

#+END_SRC

*** Settings for straight.el
Straight uses symlinks in the =build= directory which causes
=xref-find-definition= to ask ="Symbolic link to Git-controlled source
file; follow link? (y or n)"= every time, to always answer =yes=, set
=vc-follow-symlinks= true.

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-straight.el"
(setq vc-follow-symlinks t)
#+END_SRC

Use default depth of 1 when cloning files with git to get savings on network
bandwidth and disk space.

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-straight.el"
(setq straight-vc-git-default-clone-depth 1)
#+END_SRC
(setq package-enable-at-startup nil)
*** Notes
- =M-x straight-pull-all=: update all packages.
- =M-x straight-normalize-all=: restore all packages (remove local edits)
- =M-x straight-freeze-versions= and =M-x straight-thaw-versions= are like =pip
  freeze requirements.txt= and =pip install -r requirements.txt=
- To tell straight.el that you want to use the version of Org shipped with
  Emacs, rather than cloning the upstream repository:
(Note: ":tangle no")

#+BEGIN_SRC emacs-lisp :tangle no
(use-package org
  :straight (:type built-in))
#+END_SRC

In order to use =straight.el= properly, we need to add the following content to our =early-init.el= file:

#+begin_src emacs-lisp :tangle early-init.el
  ;;; early-init.el --- Emacs early init file  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;; Code to run before init.el is loaded.
  ;;; Code:

  ;; Disable package.el
  (setq package-enable-at-startup nil)

  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src
*** The =marcom-straight-el= integration of use-package
We can also have a nice integration with =use-package=:

#+begin_src emacs-lisp :tangle "modules/marcom-straight.el"
  (straight-use-package 'use-package)
  (use-package straight
    :custom (straight-use-package-by-default t)
    :bind  (("C-<f2>" . hydra-straight-helper/body)))
#+end_src

*** The =marcom-straight.el= call to provide

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-straight.el"
;;; Provide
(provide 'marcom-straight)
;;; marcom-straight.el ends here
#+end_src

For reference, I still show here how to set =use-package= with =package.el=. First we add the GNU ELPA
and MELPA archives, and then require =use-package=:

#+begin_src emacs-lisp :tangle no
  (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                           ("melpa" . "https://melpa.org/packages/"))
        package-quickstart nil)

  (eval-and-compile
    (unless (and (fboundp 'package-installed-p)
                 (package-installed-p 'use-package))
      (package-refresh-contents)
      (package-install 'use-package))
    (if init-file-debug  
        (setq use-package-compute-statistics t)
      (setq use-package-compute-statistics nil))
    (setq use-package-always-ensure t)
    (setq use-package-expand-minimally t)
    (require 'use-package))
#+end_src

** The =marcom-theme.el= module
This module includes the Theme, modeline and font config
*** Font Setup

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-theme.el"
  ;; You will most likely need to adjust this font size for your system!
  (defvar mb/default-font-size 140)
  (defvar mb/default-variable-font-size 140)

  ;; Font Selection
  ;;(set-face-attribute 'default nil :font "Fira Code Retina" :height mb/default-font-size)
  (set-face-attribute 'default nil :font "FiraCode Nerd Font" :height mb/default-font-size)
  ;; Set the fixed pitch face
  ;(set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height mb/default-font-size)
  (set-face-attribute 'fixed-pitch nil :font "FiraCode Nerd Font" :height mb/default-font-size)
  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "FiraCode Nerd Font" :height mb/default-variable-font-size :weight 'regular)
 #+END_SRC

*** Color Theme

[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can also run =M-x counsel-load-theme= to choose between them easily.

#+begin_src emacs-lisp :tangle "modules/marcom-theme.el"
(use-package doom-themes
  :init (load-theme 'doom-outrun-electric t)
  :config
    (doom-themes-org-config)
    ;(setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    ;(doom-themes-treemacs-config)
    )
#+end_src

*** Better Modeline

[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a very attractive and rich (yet still minimal) mode line configuration for Emacs.  The default configuration is quite good but you can check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

*NOTE:* The first time you load your configuration on a new machine, you'll need to run `M-x all-the-icons-install-fonts` so that mode line icons display correctly.

#+begin_src emacs-lisp :tangle "modules/marcom-theme.el"

(use-package all-the-icons
  :if (display-graphic-p))

;(use-package doom-modeline
;  :init (doom-modeline-mode 1)
;  :custom ((doom-modeline-height 15)
;           (doom-themes-neotree-config)))
(use-package doom-modeline
  :straight t
  :init (doom-modeline-mode 1)
  :config
  (setq doom-modeline-height 55)
  (setq doom-modeline-buffer-file-name-style 'relative-to-project)
  (setq doom-line-numbers-style 'relative)
  (setq doom-modeline-major-mode-icon t)
  (setq doom-modeline-buffer-state-icon t)
  (setq doom-modeline-major-mode-color-icon t))


#+end_src
*** The =marcom-theme.el= call to provide
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-theme.el"
;;; Provide
(provide 'marcom-theme)
;;; marcom-theme.el ends here
#+end_src
** The =marcom-vertico.el= module with plugins
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-vertico.el"
(use-package vertico
  :init (vertico-mode)
  :config
;;  (require 'vertico-grid)       ;; Beispiel: Grid-Modus für Datei Completion
;;  (vertico-grid-mode 1)
  (require 'vertico-repeat)
  (require 'vertico-directory))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-vertico.el"
(use-package marginalia
  :after vertico
  :init (marginalia-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-vertico.el"
(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-vertico.el"
(use-package all-the-icons-completion
  :after (marginalia)
  :init (all-the-icons-completion-mode))
(use-package all-the-icons
  :if (display-graphic-p))
#+END_SRC
