emacs/.emacs.d/config.org
*** The =marcom-vertico.el= extended search and direct actions
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-vertico.el"
(use-package consult
  :after vertico
  :bind (("C-s" . consult-line)
         ("M-g i" . consult-imenu)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-vertico.el"
(use-package embark
  :bind (("C-." . embark-act)
         ("M-." . embark-dwim))
  :init (setq embark-confirm-act-always nil))
(use-package embark-consult
  :after (embark consult))
#+END_SRC

*** The =marcom-vertico.el= call to provide
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-vertico.el"
;;; Provide
(provide 'marcom-vertico)
;;; marcom-vertico.el ends here
#+end_src
** The =marcom-which-key.el= module section 
Which-key is an indispensable tool for charting the turbulent waters of Emacs’ 
packages keybindings. These suggestions prove incredibly useful when venturing 
into the realm of a new package.

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-which-key.el"
(use-package which-key
  :straight (:build (:not native-compile))
  ;; :diminish ;; used to hide which-key in the modeline
  :custom
  (which-key-idle-secondary-delay 0.01)
  (which-key-dont-use-unicode t)
  :config
  (which-key-mode t))
;;; Provide
(provide 'marcom-which-key)
;;; marcom-which-key.el ends here
#+END_SRC

** The =marcom-keybindings.el= module section
Next to som individual keybinings i am using general.el to create my
owner custom layers.
*** The =marcom-keybindings.el= general.el definitions
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-keybindings.el"
;; Make ESC quit prompts
(use-package general
  ;;:after evil
  :config
  (general-create-definer mb/leader-keys
     :keymaps '(normal insert visual emacs)
     :prefix "SPC"
     :global-prefix "C-SPC")
  (mb/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme")
    "m" '(mu4e :which-key "mu4e")
    "n" '(hydra-mu4e-headers/body :which-key "mu4e-hydra")
    ;"c" '(hydra-org-clock/body :which-key "Clocking")
    "c" '(mb-clocking/body :which-key "Clocking")
    "g" '(org-boxes-workflow :which-key "GTD Workflow")
    "SPC" '(mb-gtd-menue/body :which-key "my menue")
    "e" '(lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/config.org")) :which-key "open config.org")))
#+END_SRC
*** The =marcom-keybindings.el= standard remaps
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-keybindings.el"
;; Use Escape to quit stuff
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; Resizing the fonts
(define-key global-map (kbd "s-=") 'text-scale-increase)
(define-key global-map (kbd "s--") 'text-scale-decrease)


;; Emacs-Config on C-c e
(global-set-key "\C-ce" '(lambda ()
                           (interactive)
                           (find-file "~/.emacs.d/config.org")))

;; Tasks-Datei auf C-c g
;;(global-set-key "\C-cg" '(lambda ()
;;                           (interactive)
;;                           (find-file "~/projects/org/tasks.org")))

;; Übersichtsseite auf C-c s
;;(global-set-key "\C-cs" '(lambda ()
;;                           (interactive)
;;                           (find-file "~/projects/org/start.org")))
  
#+END_SRC
*** The =marcom-keybindings.el= call to provide
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-keybindings.el"
;;; Provide
(provide 'marcom-keybindings)
;;; marcom-keybindings.el ends here
#+end_src
** The =marcom-org.el= module section

[[https://orgmode.org/][Org Mode]] is one of the hallmark features of Emacs.  It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package.

If Emacs is running as a server i can jot down a capture note from anywhere outside of Emacs by binding to following snippet to a convenient alias or keybinding

#+BEGIN_SRC emacs-lisp :tangle no results: none
setsid -f emacsclient -q -c -e '(abs--quick-capture)' >/dev/null 2>&1
#+END_SRC

*** The =marcom-org.el= Better Font Faces

The =mb/org-font-setup= function configures various text faces to tweak the sizes of headings and use variable width fonts in most cases so that it looks more like we're editing a document in =org-mode=.  We switch back to fixed width (monospace) fonts for code blocks and tables so that they display correctly.

#+begin_src emacs-lisp :tangle "modules/marcom-org.el"

  (defun mb/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

#+end_src

