emacs/.emacs.d/modules/marcom-vertico.el

(use-package consult
  :after vertico
  :bind (("C-s" . consult-line)
         ("M-g i" . consult-imenu)))

(use-package embark
  :bind (("C-." . embark-act)
         ("M-." . embark-dwim))
  :init (setq embark-confirm-act-always nil))
(use-package embark-consult
  :after (embark consult))

;;; Provide
(provide 'marcom-vertico)
;;; marcom-vertico.el ends here
