emacs/.emacs.d/modules/marcom-org.el

  (defun mb/org-mode-setup ()
      (org-indent-mode)
      (variable-pitch-mode 1)
      (visual-line-mode 1))

  (use-package org
      ;;:ensure org-contrib
      :straight (:type built-in)
      ;;:commands (org-capture org-agenda)
      :hook (org-mode . mb/org-mode-setup)
      :custom
      (org-src-preserve-indentation t)
      :config
      (setq org-ellipsis " ▾")
 (defvar my/org-contacts-template "* %(org-contacts-template-name)
         :PROPERTIES:
         :ADDRESS: %^{Olivzeisigweg 5, 13187 Berlin, DE}
         :BIRTHDAY: %^{Birthday}
         :EMAIL: %(org-contacts-template-email)
         :NOTE: %^{NOTE}
         :END:" "Template for org-contacts.")
    
        (setq org-capture-templates
             '(("t" "Todo" entry (file+headline "~/Syncthing/org/tasks.org" "Inbox")
                "* TODO %? %^g\n:PROPERTIES:\n:CREATED:%T\n:END:\n%i\nFrom: %a" :empty-lines 1)
               ("b" "todo" entry (file+headline "~/Syncthing/org/inbox.org" "Tasks")
         "* TODO [#A] %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
             ;;  ("j" "Journal" entry (file+olp+datetree "~/Nextcloud/org/journal.org")
             ;;   "* %?\nEntered on %U\n  %i\n %a")
               ("j" "Journal entry" entry (function org-journal-find-location)
                                    "* %(format-time-string org-journal-time-format)%^{Title}\n%i%?")
               ("c" "Contact" entry (file+headline "~/Syncthing/org/contacts.org" "Friends"),
               my/org-contacts-template
               :empty-lines 1)
               ("l" "Link" entry (file+headline "~/Syncthing/org/references.org" "Links")
                "* %? %^L %^g \n%T" :prepend t)
               ("m" "Meeting"
                entry (file+datetree "~/Syncthing/org/meetings.org")
                "* %? :meeting:%^g \n:Created: %T\n** Attendees\n*** \n** Notes\n** Action Items\n*** TODO [#A] "
                :tree-type week
                :clock-in t
                :clock-resume t
                :empty-lines 0)
               ("W" "WWW: inbox, refile later" entry (file "~/Syncthing/org/references.org")
                "* %a :website:\n\n%U %?\n\n%:initial\n" :empty-lines 1)
               ("r" "Reviews")
               ("rd" "Daily Plan" plain (file+datetree "~/Syncthing/org/work.org" )
                 (file "~/Syncthing/org/templates/tpl-daily-review.org")
                :tree-type week
                :empty-lines 0)
                ("rw" "Weekly Plan" plain (file+datetree "~/Syncthing/org/work.org" )
                 (file "~/Syncthing/org/templates/tpl-weekly-review.org")
                :tree-type week
                :empty-lines 0)
                 ("rm" "Monthly Plan" plain (file+datetree "~/Syncthing/org/work.org" )
                 (file "~/Syncthing/org/templates/tpl-monthly-review.org")
                :tree-type week
                :empty-lines 0)
               ("a" "amazon")
      ("as" "shorts" entry (file+headline "~/Syncthing/org/tasks.org" "Inbox")
                ,my-capture-template-next :empty-lines 1)
               ("aw" "Task weekly" entry (file+headline "~/Syncthing/org/tasks.org" "Tasks/Weekly")
                "* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines 1)
               ("am" "Mail link" entry (file+headline "tasks.org" "Mails")
                "* TODO %a %?\nDEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))")))

        ;; some more examples :
        ;;(setq org-capture-templates
        ;;      '(("a" "Appointment" entry (file  "~/Dropbox/orgfiles/gcal.org" )
        ;;	 "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")
        ;;	("l" "Link" entry (file+headline "~/Dropbox/orgfiles/links.org" "Links")
        ;;	 "* %? %^L %^g \n%T" :prepend t)
        ;;	("b" "Blog idea" entry (file+headline "~/Dropbox/orgfiles/i.org" "Blog Topics:")
        ;;	 "* %?\n%T" :prepend t)
        ;;	("t" "To Do Item" entry (file+headline "~/Dropbox/orgfiles/i.org" "To Do")
        ;;	 "* TODO %?\n%u" :prepend t)
        ;;	("n" "Note" entry (file+headline "~/Dropbox/orgfiles/i.org" "Note space")
        ;;	 "* %?\n%u" :prepend t)
        ;;	("s" "Screencast" entry (file "~/Dropbox/orgfiles/screencastnotes.org")
        ;;	 "* %?\n%i\n")))
        ;;(setq org-capture-templates
        ;;   '(("t" "Aufgabe in tasks.org" entry (file+headline "~/projects/org/tasks.org" "Inbox")
        ;;      "* TODO %?")
        ;;     ("w" "Waiting For Reply (Mail)" entry (file+headline "~/projects/org/tasks.org" "Inbox") 
        ;;      "* WAITING Antwort auf %a")
        ;;     ("m" "Aufgabe aus Mail" entry (file+headline "~/projects/org/tasks.org" "Inbox") 
        ;;      "* TODO %? , Link: %a")
        ;;     ("z" "Zeiteintrag in tasks.org" entry (file+headline "~/projects/org/tasks.org" "Inbox")
        ;;      "* ZKTO %? \n  %i" :clock-in t :clock-resume t)
        ;;     ("c" "Contacts" entry (file "~/projects/org/contacts.org")
        ;;      "* %(org-contacts-template-name) \n :PROPERTIES: %(org-contacts-template-email) \n :BIRTHDAY: \n :END:")
        ;;     ("j" "Journal" entry (file+datetree "~/projects/org/journal.org")
        ;;      "* %?\nEntered on %U\n  %i")
        ;;     ("p" "password" entry (file "~/projects/org/passwords.gpg")
        ;;      "* %^{Title}\n  %^{PASSWORD}p %^{USERNAME}p")))
	    :bind (("C-c a" . org-agenda)
         ("C-c c" . org-capture))
      )
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-return-follows-link t)
  ;;(setq org-drawers (quote ("PROPERTIES" "CLOCKTABLE" "LOGBOOK" "CLOCK")))
  ;(setq org-completion-use-ido t)


  ; use shift-arrows to move window focus only where no org functions are defined
  ;  (setq org-support-shift-select t)
  (add-hook 'org-shiftup-final-hook 'windmove-up)
  (add-hook 'org-shiftleft-final-hook 'windmove-left)
  (add-hook 'org-shiftdown-final-hook 'windmove-down)
  (add-hook 'org-shiftright-final-hook 'windmove-right)

(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python")))
