emacs/.emacs.d/config.org
*** Org-mode/Agenda Source files
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-org.el"

  (defvar org-default-projects-dir   "~/Syncthing/org/projects"                     "Primary GTD directory")
  (defvar org-default-technical-dir  "~/Syncthing/org/technical"                    "Directory of shareable notes")
  (defvar org-default-personal-dir   "~/Syncthing/org/personal"                     "Directory of un-shareable, personal notes")
  (defvar org-default-completed-dir  "~/Syncthing/org/archive"            "Directory of completed project files")
  (defvar org-default-inbox-file     "~/Syncthing/org/inbox.org"         "New stuff collects in this file")
  (defvar org-default-projects-file  "~/Syncthing/org/projects.org"         "Primary Project File for now")
  (defvar org-default-tasks-file     "~/Syncthing/org/tasks.org"           "Tasks, TODOs and little projects")
  (defvar org-default-incubate-file  "~/Syncthing/org/incubate.org"        "Ideas simmering on back burner")
  (defvar org-default-completed-file nil                              "Ideas simmering on back burner")
  (defvar org-default-notes-file     "~/Syncthing/org/privat.org"   "Non-actionable, personal notes")
  (defvar org-default-media-file     "~/Syncthing/org/media.org"           "White papers and links to other things to check out")

  ; (with-eval-after-load 'org
     (setq org-directory "~/Syncthing/org")
     (setq org-agenda-files
           (mapcar (lambda (path) (concat org-directory path))
                   '("/projects.org"
                      "/inbox.org"
                      "/Haus.org"
                      "/tasks.org"
		            "/arbeit-cal.org"
                 "/privat.org")))
  ;)
  ;   (add-to-list 'org-agenda-files org-default-tasks-file 'append)
  ;   (add-to-list 'org-agenda-files org-default-inbox-file 'append)
  ;   (add-to-list 'org-agenda-files "~/Nextcloud/org/calendars/calendar.org" 'append)
  ;   (add-to-list 'org-agenda-files "~/Nextcloud/org/calendars/cal-personal.org" 'append)
     ;; All projectfiles in Agenda
     ;(add-to-list 'org-agenda-files (list org-default-projects-dir))
     ;(add-to-list 'org-agenda-file-regexp "^[a-z0-9-_]+.org")
   #+END_SRC

*** Org-Agenda View Section
    #+BEGIN_SRC emacs-lisp :tangle "modules/marcom-org.el"

                        ;;  Custom Agenda View Section
                        (setq org-agenda-custom-commands
                             '(("v" "Simple agenda view"
                                ((agenda "")
                                 (alltodo "")))
                               ("c" "CIB agenda view"
                                ((agenda "")
                                 (alltodo ""))
                                ((org-agenda-show-log t)
                                 (org-agenda-ndays 7)
                                 (org-agenda-log-mode-items '(state))
                                 (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp ":CIB:"))))
                                ("C" "Team agenda view"
                                ((agenda "")
                                 (alltodo "")
                                 (tags-todo "Rambo")
                                 (tags-todo "Rados")
                                 (tags-todo "TXL1"))
                                ((org-agenda-show-log t)
                                 (org-agenda-ndays 7)
                                 (org-agenda-log-mode-items '(state))))
                               ("g" . "GTD-Workflow")
                               ("gn" "Next Actions" tags-todo "next" ((org-use-tag-inheritance nil)))
                               ("gd" "DONE" tags-todo "done" ((org-use-tag-inheritance nil)))
                               ("gw" "Waiting" todo "WAITING")
                               ("gs" "SOMEDAY" tags "someday" ((org-agenda-filter-preset 
                                                                '("+someday"))(org-agenda-todo-ignore-with-date nil)))
                               ("gf" "Agenda + flagged"
                                ((todo "WAITING")
                                 (todo "DELEGATED")
                                 (tags "flagged")
                                 (tags "TXL1")
                                 (agenda "")))
                                 ))

    #+END_SRC
*** Org-journal
   #+BEGIN_SRC emacs-lisp :tangle "modules/marcom-org.el"

   (use-package org-journal
    ;;:ensure t
    :defer t
    :custom
    (org-journal-dir "~/Syncthing/org/journal/")
    (org-journal-file-format "journal%Y-%m-%d")
    (org-journal-date-format "%e %b %Y (%A)")
    (org-journal-time-format "")
    )
    (defun org-journal-find-location ()
      ;; Open today's journal, but specify a non-nil prefix argument in order to
      ;; inhibit inserting the heading; org-capture will insert the heading.
      (org-journal-new-entry t)
      ;; Position point on the journal's top-level heading so that org-capture
      ;; will add the new entry as a child entry.
      (goto-char (point-min)))
   #+END_SRC

*** Org-archive config
Org-archive will store archives into a subfolder with year/month_archiv ending
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-org.el"

;; Archive config - move to archive file accordng to month of archiving
(setq org-archive-location (concat "archive/%s-"
                                  (format-time-string "%Y%m" (current-time))
                                  "_archiv::"))
#+END_SRC
*** The =marcom-org.el= ORg-Babel/Codeblock section
Activate the following languages
   #+BEGIN_SRC emacs-lisp :tangle "modules/marcom-org.el"
   (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
     (python . t)
     (shell . t)
     (js . t)
     (latex . t)
     (org . t)
     (dot . t)
    ;; (gnuplot . t)
    ;; (ruby . t)
    ;;(screen . nil)
    ;; (ledger . t)
     ;;(C . t)
     (sql . t)
     (ditaa . t)))
   #+END_SRC
   Activate Syntax Highlighting in Source Code Blocks
   #+BEGIN_SRC emacs-lisp
   (setq org-src-fontify-natively t)
   #+END_SRC
   Inline Code evaluation
   #+BEGIN_SRC emacs-lisp
   (setq org-confirm-babel-evaluate t)
   (require 'ob-python)
   #+END_SRC
