emacs/.emacs.d/modules/marcom-org.el

(use-package hydra
  :defer t)

          (defhydra hydra-org-refiler (org-mode-map "C-c s" :hint nil)
              "
            ^Navigate^      ^Refile^       ^Move^           ^Update^        ^Go To^        ^Dired^
            ^^^^^^^^^^---------------------------------------------------------------------------------------
            _k_: ↑ previous _t_: tasks     _m X_: projects  _T_: todo task  _g t_: tasks    _g X_: projects
            _j_: ↓ next     _i_: incubate  _m P_: personal  _S_: schedule   _g i_: incubate _g P_: personal
            _a_: archive    _p_: personal  _m T_: technical _D_: deadline   _g x_: inbox    _g T_: technical
            _d_: delete     _r_: refile                   _R_: rename     _g n_: notes    _g C_: completed
            "
              ("<up>" org-previous-visible-heading)
              ("<down>" org-next-visible-heading)
              ("k" org-previous-visible-heading)
              ("j" org-next-visible-heading)
          ;    ("c" org-archive-subtree-as-completed) ;; idea to archive into journal files
              ("a" org-archive-subtree)
              ("d" org-cut-subtree)
              ("t" org-refile-to-task)
              ("i" org-refile-to-incubate)
              ("p" org-refile-to-personal-notes)
              ("r" org-refile)
              ("m X" org-refile-to-projects-dir)
              ("m P" org-refile-to-personal-dir)
              ("m T" org-refile-to-technical-dir)
              ("T" org-todo)
              ("S" org-schedule)
              ("D" org-deadline)
              ("R" org-rename-header)
              ("g t" (find-file-other-window org-default-tasks-file))
              ("g i" (find-file-other-window org-default-incubate-file))
              ("g x" (find-file-other-window org-default-inbox-file))
              ("g c" (find-file-other-window org-default-completed-file))
              ("g n" (find-file-other-window org-default-notes-file))
              ("g X" (show-project-notes))
          ;    ("g X" (dired org-default-projects-dir))
          ;    ("g P" (dired org-default-personal-dir))
              ("g P" (show-personal-notes))
              ("g T" (show-technical-notes))
          ;    ("g T" (dired org-default-technical-dir))
              ("g C" (dired org-default-completed-dir))
              ("[\t]" (org-cycle))
              ("s" (org-save-all-org-buffers) "save")
              ("q" nil "quit"))

          ;; Hydra functions as of howards blog
          (defun org-subtree-region ()
            "Return a list of the start and end of a subtree."
            (save-excursion
              (list (progn (org-back-to-heading) (point))
                    (progn (org-end-of-subtree)  (point)))))

          (defun org-refile-directly (file-dest)
            "Move the current subtree to the end of FILE-DEST.
          If SHOW-AFTER is non-nil, show the destination window,
          otherwise, this destination buffer is not shown."
            (interactive "Destination: ")

            (defun dump-it (file contents)
              (find-file-other-window file-dest)
              (goto-char (point-max))
              (insert "\n" contents))

            (save-excursion
              (let* ((region (org-subtree-region))
                     (contents (buffer-substring (first region) (second region))))
                (apply 'kill-region region)
                (if org-refile-directly-show-after
                    (save-current-buffer (dump-it file-dest contents))
                  (save-window-excursion (dump-it file-dest contents))))))

          (defvar org-refile-directly-show-after nil
            "When refiling directly (using the `org-refile-directly'
          function), show the destination buffer afterwards if this is set
          to `t', otherwise, just do everything in the background.")

          (defun org-refile-to-incubate ()
            "Refile (move) the current Org subtree to `org-default-incubate-file'."
            (interactive)
            (org-refile-directly org-default-incubate-file))

          (defun org-refile-to-task ()
            "Refile (move) the current Org subtree to `org-default-tasks-file'."
            (interactive)
            (org-refile-directly org-default-tasks-file ))

          (defun org-refile-to-personal-notes ()
            "Refile (move) the current Org subtree to `org-default-notes-file'."
            (interactive)
            (org-refile-directly org-default-notes-file))

          (defun org-refile-to-completed ()
            "Refile (move) the current Org subtree to `org-default-completed-file',
          unless it doesn't exist, in which case, refile to today's journal entry."
            (interactive)
            (if (and org-default-completed-file (file-exists-p org-default-completed-file))
                (org-refile-directly org-default-completed-file)
              (org-refile-directly (get-journal-file-today))))

          (defun org-rename-header (label)
            "Rename the current section's header to LABEL, and moves the
          point to the end of the line."
            (interactive (list
                          (read-string "Header: "
                                       (substring-no-properties (org-get-heading t t t t)))))
            (org-back-to-heading)
            (replace-string (org-get-heading t t t t) label))

          (defun org-archive-subtree-as-completed ()
            "Archives the current subtree to today's current journal entry."
            (interactive)
            ;; According to the docs for `org-archive-subtree', the state should be
            ;; automatically marked as DONE, but I don't notice that:
            (when (org-get-todo-state)
              (org-todo "DONE"))

            (let* ((org-archive-file (or org-default-completed-file
                                         (todays-journal-entry)))
                   (org-archive-location (format "%s::" org-archive-file)))
               (org-archive-subtree)))

          (defun todays-journal-entry ()
            "Return the full pathname to the day's journal entry file.
          Granted, this assumes each journal's file entry to be formatted
          with year/month/day, as in `20190104' for January 4th.

          Note: `org-journal-dir' variable must be set to the directory
          where all good journal entries live, e.g. ~/journal."
            (let* ((daily-name   (format-time-string "%Y%m%d"))
                   (file-name    (concat org-journal-dir daily-name)))
              (expand-file-name file-name)))

          (defun org-boxes-workflow ()
            "Load the default tasks file and start our hydra on the first task shown."
            (interactive)
            (let ((org-startup-folded nil))
              (find-file org-default-tasks-file)
              (delete-other-windows)
              (ignore-errors
                (mb/org-agenda))
              (delete-other-windows)
              (split-window-right)
              ;;(split-window-right-and-focus) seems to be gone
              (pop-to-buffer (get-file-buffer org-default-tasks-file))
              (goto-char (point-min))
              (org-next-visible-heading 1)
              (hydra-org-refiler/body)))

          (defun mb/org-agenda ()
            "Displays my favorite agenda perspective."
            (interactive)
            (org-agenda nil "a")
            (get-buffer "*Org Agenda*")
            (execute-kbd-macro (kbd "A t")))
     ;; Org Hydra
     (global-set-key (kbd "<f4>") 'hydra-org-refiler/body)

;;; Provide
