emacs/.emacs.d/config.org
*** The pretty hydra
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-org.el"
(use-package pretty-hydra
  :defer t
  :after hydra)

(pretty-hydra-define hydra-org-refiler
  (:hint nil :color blue :quit-key "q" :title "Org Refiler" :separator "-")
  ("Navigate"
   (("k" org-previous-visible-heading "↑ previous")
    ("j" org-next-visible-heading "↓ next")
    ("a" org-archive-subtree "archive")
    ("d" org-cut-subtree "delete"))

   "Refile"
   (("t" org-refile-to-task "tasks")
    ("i" org-refile-to-incubate "incubate")
    ("p" org-refile-to-personal-notes "personal")
    ("r" org-refile "refile"))

   "Move"
   (("m X" org-refile-to-projects-dir "projects")
    ("m P" org-refile-to-personal-dir "personal")
    ("m T" org-refile-to-technical-dir "technical"))

   "Update"
   (("T" org-todo "todo task")
    ("S" org-schedule "schedule")
    ("D" org-deadline "deadline")
    ("R" org-rename-header "rename"))

   "Go To"
   (("g t" (find-file-other-window org-default-tasks-file) "tasks")
    ("g i" (find-file-other-window org-default-incubate-file) "incubate")
    ("g x" (find-file-other-window org-default-inbox-file) "inbox")
    ("g c" (find-file-other-window org-default-completed-file) "completed")
    ("g n" (find-file-other-window org-default-notes-file) "notes"))

   "Navigation"
   (("g X" show-project-notes "projects")
    ("g P" show-personal-notes "personal")
    ("g T" show-technical-notes "technical")
    ("g C" (dired org-default-completed-dir) "completed")
    ("s" org-save-all-org-buffers "save"))))

          ;; Hydra functions as of howards blog
          (defun org-subtree-region ()
            "Return a list of the start and end of a subtree."
            (save-excursion
              (list (progn (org-back-to-heading) (point))
                    (progn (org-end-of-subtree)  (point)))))

          (defun org-refile-directly (file-dest)
            "Move the current subtree to the end of FILE-DEST.
          If SHOW-AFTER is non-nil, show the destination window,
          otherwise, this destination buffer is not shown."
            (interactive "Destination: ")

            (defun dump-it (file contents)
              (find-file-other-window file-dest)
              (goto-char (point-max))
              (insert "\n" contents))

            (save-excursion
              (let* ((region (org-subtree-region))
                     (contents (buffer-substring (first region) (second region))))
                (apply 'kill-region region)
                (if org-refile-directly-show-after
                    (save-current-buffer (dump-it file-dest contents))
                  (save-window-excursion (dump-it file-dest contents))))))

          (defvar org-refile-directly-show-after nil
            "When refiling directly (using the `org-refile-directly'
          function), show the destination buffer afterwards if this is set
          to `t', otherwise, just do everything in the background.")

          (defun org-refile-to-incubate ()
            "Refile (move) the current Org subtree to `org-default-incubate-file'."
            (interactive)
            (org-refile-directly org-default-incubate-file))

          (defun org-refile-to-task ()
            "Refile (move) the current Org subtree to `org-default-tasks-file'."
            (interactive)
            (org-refile-directly org-default-tasks-file ))

          (defun org-refile-to-personal-notes ()
            "Refile (move) the current Org subtree to `org-default-notes-file'."
            (interactive)
            (org-refile-directly org-default-notes-file))

          (defun org-refile-to-completed ()
            "Refile (move) the current Org subtree to `org-default-completed-file',
          unless it doesn't exist, in which case, refile to today's journal entry."
            (interactive)
            (if (and org-default-completed-file (file-exists-p org-default-completed-file))
                (org-refile-directly org-default-completed-file)
              (org-refile-directly (get-journal-file-today))))

          (defun org-rename-header (label)
            "Rename the current section's header to LABEL, and moves the
          point to the end of the line."
            (interactive (list
                          (read-string "Header: "
                                       (substring-no-properties (org-get-heading t t t t)))))
            (org-back-to-heading)
            (replace-string (org-get-heading t t t t) label))

          (defun org-archive-subtree-as-completed ()
            "Archives the current subtree to today's current journal entry."
            (interactive)
            ;; According to the docs for `org-archive-subtree', the state should be
            ;; automatically marked as DONE, but I don't notice that:
            (when (org-get-todo-state)
              (org-todo "DONE"))

            (let* ((org-archive-file (or org-default-completed-file
                                         (todays-journal-entry)))
                   (org-archive-location (format "%s::" org-archive-file)))
               (org-archive-subtree)))

          (defun todays-journal-entry ()
            "Return the full pathname to the day's journal entry file.
          Granted, this assumes each journal's file entry to be formatted
          with year/month/day, as in `20190104' for January 4th.

          Note: `org-journal-dir' variable must be set to the directory
          where all good journal entries live, e.g. ~/journal."
            (let* ((daily-name   (format-time-string "%Y%m%d"))
                   (file-name    (concat org-journal-dir daily-name)))
              (expand-file-name file-name)))

          (defun org-boxes-workflow ()
            "Load the default tasks file and start our hydra on the first task shown."
            (interactive)
            (let ((org-startup-folded nil))
              (find-file org-default-tasks-file)
              (delete-other-windows)
              (ignore-errors
                (mb/org-agenda))
              (delete-other-windows)
              (split-window-right)
              ;;(split-window-right-and-focus) seems to be gone
              (pop-to-buffer (get-file-buffer org-default-tasks-file))
              (goto-char (point-min))
              (org-next-visible-heading 1)
              (hydra-org-refiler/body)))

          (defun mb/org-agenda ()
            "Displays my favorite agenda perspective."
            (interactive)
            (org-agenda nil "a")
            (get-buffer "*Org Agenda*")
            (execute-kbd-macro (kbd "A t")))
     ;; Org Hydra
     (global-set-key (kbd "<f4>") 'hydra-org-refiler/body)
   #+END_SRC
   
*** The =marcom-org.el= call to provide
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-org.el"
;;; Provide
(provide 'marcom-org)
;;; marcom-org.el ends here
#+end_src

** The =marcom-deft.el= module and their GTD functions

#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-deft.el"
(use-package deft
;;  :ensure t
  :config 
  (setq deft-directory "~/Syncthing/org/notes/")
  (setq deft-strip-title-regexp "\\(?:^%+\\|^#\\+TITLE: *\\|^#\\+COMMENT: *\\|^[#* ]+\\|-\\*-[[:alpha:]]+-\\*-\\|^Title:[  ]*\\|#+$\\)")
  (setq deft-text-mode 'org-mode)
  (setq deft-extension "org")
  (setq deft-extensions '("org"))
  (setq deft-default-extension "org")

  ;; to create new files based on title
  (setq deft-use-filename-as-title nil)
  (setq deft-use-filter-string-for-filename t)
  (setq deft-file-naming-rules
      '((noslash . "-")
        (nospace . "-")
        (case-fn . downcase))))

(defun show-notes ()
  (interactive)
  (hs-kill-buffers "*Deft*")
  (when deft-directory "~/Syncthing/org/notes/"
        (setq-default deft-directory "~/Syncthing/org/notes/"))
  (deft))

(defun show-project-notes ()
  (interactive)
  (hs-kill-buffers "*Deft*")
  (setq-default deft-directory "~/Syncthing/org/projects/")
  (deft))

(defun show-technical-notes ()
  (interactive)
  (hs-kill-buffers "*Deft*")
  (setq-default deft-directory "~/Syncthing/org/technical/")
  (deft))

(defun show-personal-notes ()
  (interactive)
  (hs-kill-buffers "*Deft*")
  (setq-default deft-directory "~/Syncthing/org/personal/")
  (deft))

;; Deft mit Notizen auf C-c n
(global-set-key "\C-cn" 'show-notes)
(global-set-key "\C-cP" 'show-project-notes)

;; Deft mit programming notes auf C-c p
(global-set-key "\C-cp" 'show-personal-notes)
(global-set-key "\C-ct" 'show-technical-notes)

(require 'cl)
(defun hs-kill-buffers (regexp)
  "Kill buffers matching REGEXP without asking for confirmation."
  (interactive "sKill buffers matching this regular expression: ")
  (flet ((kill-buffer-ask (buffer) (kill-buffer buffer)))
    (kill-matching-buffers regexp)))
(setq deft-recursive t)
  
;;key to launch deft
(global-set-key (kbd "C-c d") 'deft)
#+END_SRC
*** The =marcom-deft.el= call to provide
#+BEGIN_SRC emacs-lisp :tangle "modules/marcom-deft.el"
;;; Provide
(provide 'marcom-deft)
;;; marcom-deft.el ends here
#+end_src
* Example Package Install with use-package

Here are examples of use-package declarations that will install packages using straight.el by default:

#+begin_src emacs-lisp
;; Install and configure magit
(use-package magit
  :defer t
  :commands (magit-status)
  :config
  (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; Install and configure which-key
;;(use-package which-key
;;  :init
;;  (which-key-mode)
;;  :config
;;  (setq which-key-idle-delay 0.5))
;;#+end_src

* Alternative:  Per-Package Integration

If you don't want every use-package declaration to use straight.el, you can turn off `straight-use-package-by-default` and just add `:straight t` to individual use-package blocks:

#+begin_src emacs-lisp
#(use-package org-modern
#  :straight t
#  :config
#  (org-modern-mode))
##+end_src
