emacs/.emacs.d/modules/marcom-org.el
(provide 'marcom-org)
;;; marcom-org.el ends here
